Revit 2027 API
XYZ.IsAlmostEqualTo(XYZ) Method
Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAlmostEqualTo(
	XYZ source
)
Public Function IsAlmostEqualTo (
	source As XYZ
) As Boolean
public:
bool IsAlmostEqualTo(
	XYZ^ source
)
member IsAlmostEqualTo :
        source : XYZ -> bool
Parameters
source XYZ
The vector to compare with this vector.
Return Value
Boolean
True if the vectors are the same; otherwise, false.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
This routine uses Revit's default tolerance to compare two vectors to see if they are almost equivalent. Because the tolerance is small enough this can also be used to compare two points.
See Also
Reference
XYZ Class
IsAlmostEqualTo Overload
Autodesk.Revit.DB Namespace